In [2]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# count
각 열에 포함된 데이터의 개수. 결측치가 없는 경우 총 데이터 수를 나타냅니다.

# mean
평균값. 데이터의 전반적인 경향을 보여줍니다.

# std
표준편차. 데이터가 평균으로부터 얼마나 퍼져 있는지를 나타냅니다. 값이 클수록 데이터의 변동성이 크다는 의미입니다.

# min
최소값. 해당 열에서 가장 작은 값을 나타냅니다.

# 25%
1사분위수. 데이터의 하위 25%에 해당하는 값으로, 데이터의 첫 번째 사분위수를 나타냅니다.

# 50%
중앙값(중위수). 데이터의 중간값으로, 데이터의 절반이 이 값보다 작고 나머지 절반이 이 값보다 큽니다.

# 75%
3사분위수. 데이터의 상위 25%에 해당하는 값으로, 데이터의 세 번째 사분위수를 나타냅니다.

# max
최대값. 해당 열에서 가장 큰 값을 나타냅니다.

In [5]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
# 나이 결측치를 중앙값으로 대체
titanic['age'] = titanic['age'].fillna(titanic['age'].median())

# 탑승지 결측치를 최빈값으로 대체
titanic['embarked'] = titanic['embarked'].fillna(titanic['embarked'].mode()[0])

In [12]:
titanic['age'].isnull().sum()

0

In [13]:
titanic['embarked'].isnull().sum()

0

In [9]:
titanic['sex'] = titanic['sex'].map({'male': 0, 'female': 1})
titanic['alive'] = titanic['alive'].map({'no': 1, 'yes': 0})
titanic['embarked'] = titanic['embarked'].map({'C': 0, 'Q': 1, 'S': 2,})

In [10]:
titanic['sex'].head()

0    0
1    1
2    1
3    1
4    0
Name: sex, dtype: int64

In [11]:
titanic['alive'].head()

0    1
1    0
2    0
3    0
4    1
Name: alive, dtype: int64

In [14]:
titanic['embarked'].head()

0    2
1    0
2    2
3    2
4    2
Name: embarked, dtype: int64

In [15]:
titanic['family_size'] = titanic['sibsp'] + titanic['parch'] + 1

In [16]:
print(titanic['family_size'].head())

0    2
1    2
2    1
3    2
4    1
Name: family_size, dtype: int64